In [14]:
import pandas as pd

data = {
    "name": ["Amit", "Neha", "Raj", "Sara", "Kunal"],
    "city": ["Pune", "Mumbai", "Pune", "Delhi", "Pune"],
    "age": [22, 25, 23, 26, 24],
    "salary": [30000, 45000, 35000, 50000, 40000]
}

df = pd.DataFrame(data)

df

    name    city  age  salary
0   Amit    Pune   22   30000
1   Neha  Mumbai   25   45000
2    Raj    Pune   23   35000
3   Sara   Delhi   26   50000
4  Kunal    Pune   24   40000

In [15]:
#show all names in a single variable

df["city"]

0      Pune
1    Mumbai
2      Pune
3     Delhi
4      Pune
Name: city, dtype: str

In [17]:
# show multiple column names
df[["name", "city"]]

    name    city
0   Amit    Pune
1   Neha  Mumbai
2    Raj    Pune
3   Sara   Delhi
4  Kunal    Pune

In [18]:
#show rows where city = pune

df["city"] == "Pune"

0     True
1    False
2     True
3    False
4     True
Name: city, dtype: bool

In [19]:
df

    name    city  age  salary
0   Amit    Pune   22   30000
1   Neha  Mumbai   25   45000
2    Raj    Pune   23   35000
3   Sara   Delhi   26   50000
4  Kunal    Pune   24   40000

In [20]:
df["city"] == "Pune"

0     True
1    False
2     True
3    False
4     True
Name: city, dtype: bool

In [42]:
df[ (df["salary"]>40000) ]

   name    city  age  salary
1  Neha  Mumbai   25   45000
3  Sara   Delhi   26   50000

In [43]:
# show those rows where salary > 40000
df[df["salary"] > 40000]

   name    city  age  salary
1  Neha  Mumbai   25   45000
3  Sara   Delhi   26   50000

In [44]:
#2 conditions in a single query

df[ (df["city"]=="Pune") & (df["salary"]>35000) ]

    name  city  age  salary
4  Kunal  Pune   24   40000

In [48]:
#2 conditions with OR (|)

df[ (df["city"] == "Delhi") | (df["age"] <23) ]

   name   city  age  salary
0  Amit   Pune   22   30000
3  Sara  Delhi   26   50000

In [62]:
#Selecting columns after filtering

df.loc[ (df["city"] == "Pune"), ["name","city"] ]

    name  city
0   Amit  Pune
2    Raj  Pune
4  Kunal  Pune

In [67]:
#Selecting multiple columns after filtering

df.loc[df["salary"] >= 40000, ["name", "city"]]

    name    city
1   Neha  Mumbai
3   Sara   Delhi
4  Kunal    Pune

In [74]:
#Add a new column with values for each row
df["tax"] = df["age"] *0.10
df

    name    city  age  salary  tax
0   Amit    Pune   22   30000  2.2
1   Neha  Mumbai   25   45000  2.5
2    Raj    Pune   23   35000  2.3
3   Sara   Delhi   26   50000  2.6
4  Kunal    Pune   24   40000  2.4

In [78]:
#Getting a boolean mask
df["salary"] > 40000

0    False
1     True
2    False
3     True
4    False
Name: salary, dtype: bool

In [83]:
#Counting rows and columns in filtered dataset
df[ (df["city"] == "Pune") ].shape

(3, 5)

In [87]:
#unique values
df["city"].unique()

<StringArray>
['Pune', 'Mumbai', 'Delhi']
Length: 3, dtype: str

In [88]:
# count of each city
df["city"].value_counts()

city
Pune      3
Mumbai    1
Delhi     1
Name: count, dtype: int64

In [89]:
#group by 
df.groupby("city")["salary"].mean()

city
Delhi     50000.0
Mumbai    45000.0
Pune      35000.0
Name: salary, dtype: float64